<html>
<head>
</head>
<body>
<?
$content = "ชวนมาสัมผัสความงามท้องทะเลของหมู่เกาะสุรินทร์ จังหวัดพังงา ที่สวยงามสมคำร่ำลือ pic1
ใครได้ลองมาเที่ยวเป็นต้องติดใจกลับมารอบสองแน่นอน pic1 จริงอย่างที่เขาว่าไว้...ว่าท้องทะเลไทยสวยงามไม่แพ้ชาติใดในโลก";

// if (strpos($content, 'pic1') == TRUE) {
//   if(stristr($content, 'pic1') === TRUE) {
//   echo "found";
// }else{
//   echo "not found";
// }

str_replace("pic1","<img src='img/1.jpg'>","ชวนมาสัมผัสความงามท้องทะเลของหมู่เกาะสุรินทร์ จังหวัดพังงา ที่สวยงามสมคำร่ำลือ pic1
ใครได้ลองมาเที่ยวเป็นต้องติดใจกลับมารอบสองแน่นอน pic1 จริงอย่างที่เขาว่าไว้...ว่าท้องทะเลไทยสวยงามไม่แพ้ชาติใดในโลก");
?>

</body>
</html>